external/swak/examples/other/simpleBendedPipe/0/R
/*---------------------------------------------------------------------------*
Caelus 6.10
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    upperWall
    {
        type            kqRWallFunction;
        value           uniform ( 0 0 0 0 0 0 );
    }

    lowerWall
    {
        type            kqRWallFunction;
        value           uniform ( 0 0 0 0 0 0 );
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
